import React from 'react';
import FAQs from './FAQs';

const FAQList: React.FC = () => {

    const faqs: { question: string; answer: string }[] = [
        { question: 'איך אני יכול למצוא פסיכולוג שמתאים לי', answer: 'המערכת שלנו מאפשרת לך לחפש בקלות פסיכולוגים לפי אזור מגורים, תחום מומחיות, שפה, וניסיון מקצועי. באפשרותך לעיין בפרופילים של אנשי מקצוע, לקרוא עליהם מידע וליצור איתם קשר ישירות דרך האתר' },
        { question: 'האם השירות באתר הוא בחינם?', answer: 'כן! החיפוש באתר הוא לגמרי בחינם, ותוכל למצוא את הפסיכולוג שמתאים לך מבלי לשלם דבר. התשלום עבור הטיפול עצמו יתבצע מול המטפל באופן ישיר, בהתאם לתנאים שהוא מציע.' },
        { question: 'איך אני קובע פגישה עם פסיכולוג דרך האתר?', answer: 'לאחר שמצאת מטפל שמתאים לך, תוכל ללחוץ על "צור קשר" בפרופיל שלו. הפסיכולוג יוכל לספק לך מידע נוסף על השירותים שהוא מציע, שעות פעילות, ואפשרויות לתיאום פגישה.' },
    ];

    return (
        <div className="faq-list">
            {faqs.map((faq, index) => (
                <FAQs key={index} question={faq.question} answer={faq.answer} />
            ))}
        </div>
    );
};

export default FAQList;
